Словарь/src/InformationRegisters/СвязанныеСлова/СвязанныеСлова.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеСлова</name>
  <dimensions>
    <name>Слово1</name>
    <type>
      <types>CatalogRef.Словарь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Слово2</name>
    <type>
      <types>CatalogRef.Словарь</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Словарь/src/InformationRegisters/СвязанныеСлова/ManagerModule.bsl
Функция СвязанныеСлова(Слово) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязанныеСлова.Слово2 КАК Слово
	|ИЗ
	|	РегистрСведений.СвязанныеСлова КАК СвязанныеСлова
	|ГДЕ
	|	СвязанныеСлова.Слово1 = &Слово
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СвязанныеСлова.Слово1
	|ИЗ
	|	РегистрСведений.СвязанныеСлова КАК СвязанныеСлова
	|ГДЕ
	|	СвязанныеСлова.Слово2 = &Слово
	|
	|УПОРЯДОЧИТЬ ПО
	|	Слово";
	Запрос.УстановитьПараметр("Слово", Слово);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Слово");
	
КонецФункции
